# Add Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCAggregate..::..Add Method
IFCAggregate Class See Also
---
Adds an element to the aggregate.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void Add(
	IFCData ifcData
)
```

Visual Basic
---
```text
Public Sub Add ( _
	ifcData As IFCData _
)
```

Visual C++
---
```text
public:
void Add(
	IFCData^ ifcData
)
```

# ### Parameters
ifcData
    Type: Autodesk.Revit.DB.IFC..::..IFCData The IFCData element.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The aggregate is not valid. |

# See Also
IFCAggregate Class
Autodesk.Revit.DB.IFC Namespace